{
  "title": "DARE Update Custom Preferences",
  "description": "Use to customise DARE Update user prompt preferences.",
  "__preferencedomain": "com.dare.update.preferences",
  "properties": {
    "GeneralOptions": {
      "type": "object",
      "title": "General Options",
      "properties": {
        "hourlyCheck": {
          "default": "true",
          "format": "checkbox",
          "title": "Allow Hourly Update Attempts",
          "description": "Determines whether DARE Update should check for updates and attempt to silently install them once every hour. Uncheck this option to prevent DARE Update from checking for new updates once every hour (not recommended)",
          "type": "boolean"
        },
        "updatePrompts": {
          "default": "true",
          "format": "checkbox",
          "title": "Allow Recurring Update Prompts",
          "description": "Determines whether DARE Update should prompt users to install pending cached updates on a recurring interval. Uncheck this option to disable all recurring update prompts (not recommended). To configure the behaviour of recurring update prompts, use the options under the \"Scheduled Updates\" section of this profile",
          "type": "boolean"
        },
        "autoUpdate": {
          "default": "true",
          "format": "checkbox",
          "title": "Automatic Self Updates",
          "description": "Determines whether DARE Update automatically updates itself when new major and point releases are available. Uncheck this option if you prefer to manually update DARE Update",
          "type": "boolean"
        },
        "allowedAppInstalls": {
          "title": "Allowed Installs",
          "description": "By default, all Apps within the DARE Update App catalog are available for installs. If you prefer to limit which Apps can be installed by DARE Update, specify the App identifiers below. You can specify as many unique identifiers as you wish, using the App Catalog unique identifiers for each App. App Catalog: www.dareupdate.co. Note: If you specify an App in this list which is also in the Excluded App Installs list, the exclusion will override this setting",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Allowed install App identifier"
              }
            }
          ]
        },
        "excludedAppInstalls": {
          "title": "Excluded Installs",
          "description": "By default, all Apps within the DARE Update App catalog are available for installs. If you wish to allow installs for all Apps in the catalog with the exception of only a few Apps, specify the Apps you wish to exclude below. You can specify as many unique App identifiers as you wish, using the App Catalog unique identifiers for each App. App Catalog: www.dareupdate.co. Note: If you specify an exclusion App below which is also in the Allowed App Installs list, only the exclusion will be respected",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Excluded install App identifier"
              }
            }
          ]
        },
        "allowedAppUpdates": {
          "title": "Allowed Updates",
          "description": "By default, all Apps within the DARE Update App catalog will be updated if installed. If you prefer to limit which Apps can be updated by DARE Update, specify the App identifiers below. You can specify as many unique identifiers as you wish, using the App Catalog unique identifiers for each App. App Catalog: www.dareupdate.co. Note: If you specify an App in this list which is also in the Excluded App Updates list, the exclusion will override this setting",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Allowed update App identifier"
              }
            }
          ]
        },
        "excludedAppUpdates": {
          "title": "Excluded Updates",
          "description": "By default, all Apps within the DARE Update App catalog will be updated if installed. If you wish to allow updates for all Apps in the catalog with the exception of only a few Apps, specify the Apps you wish to exclude below. You can specify as many unique App identifiers as you wish, using the App Catalog unique identifiers for each App. App Catalog: www.dareupdate.co. Note: If you specify an exclusion App below which is also in the Allowed App Updates list, only the exclusion will be respected",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Excluded update App identifier"
              }
            }
          ]
        }
      }
    },
    "ScheduledUpdates": {
      "type": "object",
      "title": "Scheduled Update Options",
      "properties": {
        "runFrequency": {
          "format": "grid",
          "properties": {
            "runType": {
              "default": "specifyFrequency",
              "enum": [
                "specifyFrequency",
                "specifyPatchDay"
              ],
              "options": {
                "enum_titles": [
                  "Specify Patch Frequency",
                  "Specify Recurring Patch Day"
                ]
              },
              "title": "Run Frequency Option",
              "description": "This defines when to prompt users to install any pending updates. You can either limit user prompts to a specified weekly patch day, or alternatively select a frequency to prompt the users, e.g., once every 2 weeks",
              "type": "string",
              "propertyOrder": 1
            },
            "frequencyOption": {
              "default": "oneWeek",
              "enum": [
                "oneDay",
                "oneWeek",
                "twoWeeks",
                "threeWeeks",
                "fourWeeks"
              ],
              "options": {
                "dependencies": {
                  "runType": "specifyFrequency"
                },
                "enum_titles": [
                  "Once every day",
                  "Once every week",
                  "Once every two weeks",
                  "Once every three weeks",
                  "Once every four weeks"
                ]
              },
              "title": "Frequency to prompt users",
              "description": "A recurring update frequency time window which determines how often users are prompted to install pending updates, e.g., Once every week",
              "type": "string",
              "minLength": 1
            },
            "frequencyElapsedMode": {
              "default": "singlePromptMode",
              "enum": [
                "singlePromptMode",
                "recurringPromptMode"
              ],
              "options": {
                "dependencies": {
                  "runType": "specifyFrequency"
                },
                "enum_titles": [
                  "Single Prompt Mode",
                  "Recurring Prompt Mode"
                ]
              },
              "title": "Frequency Elapsed Behaviour",
              "description": "Determines how frequently users should be prompted if they defer the update once the configured patch frequency time has elapsed. Deferring updates with Single Prompt Mode enabled causes update prompts to be postponed until the patch frequency has elapsed again. Recurring Prompt Mode ensures users are prompted to update on a regular recurring interval after deferring until they update, and the patch frequency will only be reactivated after the updates are installed",
              "type": "string",
              "minLength": 1
            },
            "deferralWindow": {
              "title": "Recurring Prompt Mode Deferral Window (Patch Frequency)",
              "description": "When using recurring prompt mode, use this setting to define the amount of time in minutes a user can defer the update",
              "type": "integer",
              "minimum": 1,
              "default": 60,
              "options": {
                "inputAttributes": {
                  "placeholder": "60"
                },
                "dependencies": {
                  "frequencyElapsedMode": "recurringPromptMode"
                }
              }
            },
            "patchDay": {
              "default": 3,
              "title": "Patch Day",
              "type": "integer",
              "minLength": 1,
              "propertyOrder": 20,
              "description": "The day of the week to prompt users to install cached updates",
              "enum": [
                2,
                3,
                4,
                5,
                6,
                7,
                1
              ],
              "options": {
                "enum_titles": [
                  "Monday",
                  "Tuesday",
                  "Wednesday",
                  "Thursday",
                  "Friday",
                  "Saturday",
                  "Sunday"
                ],
                "dependencies": {
                  "runType": "specifyPatchDay"
                }
              }
            },
            "patchDayFrequency": {
              "default": "singlePromptMode",
              "enum": [
                "singlePromptMode",
                "recurringPromptMode"
              ],
              "options": {
                "dependencies": {
                  "runType": "specifyPatchDay"
                },
                "enum_titles": [
                  "Single Prompt Mode",
                  "Recurring Prompt Mode"
                ]
              },
              "title": "Patch Day Prompt Frequency",
              "description": "Determines how often users should be prompted to update on the configured patch day if they defer the update. Use the Single Prompt Mode to carry the deferral to the following weekly patch day, or alternatively, use Recurring Prompt Mode to continue to prompt users to update on a recurring interval on the configured patch day if they defer the update",
              "type": "string",
              "minLength": 1
            },
            "patchDayDeferralWindow": {
              "title": "Recurring Prompt Mode Deferral Window (Patch Day)",
              "description": "When using recurring prompt mode, use this setting to define the amount of time in minutes a user can defer the update before being prompted again",
              "type": "integer",
              "minimum": 1,
              "default": 60,
              "options": {
                "inputAttributes": {
                  "placeholder": "60"
                },
                "dependencies": {
                  "patchDayFrequency": "recurringPromptMode"
                }
              }
            },
            "missedUpdatePrompt": {
              "default": true,
              "description": "When enabled, DARE Update will prompt the user to update whenever the device comes back online if it was offline on the defined patch day, or if the user deferred all update prompts when using Recurring Prompt Mode. Alternatively, leave this unchecked to wait until the next patch day to prompt the user if their device was offline on the previous patch day",
              "format": "checkbox",
              "title": "Missed Update Prompts",
              "type": "boolean",
              "options": {
                "dependencies": {
                  "runType": "specifyPatchDay"
                }
              }
            }
          },
          "required": [
            "runType"
          ],
          "title": "Run Frequency Options",
          "type": "object"
        },
        "runLimitations": {
          "format": "grid",
          "properties": {
            "monday": {
              "default": "false",
              "format": "checkbox",
              "title": "Monday",
              "description": "If selected, update prompts will be allowed on Mondays",
              "type": "boolean"
            },
            "mondayStartTime": {
              "description": "If you allowed updates on Mondays, use to define the time on a Monday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Monday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "mondayEndTime": {
              "description": "If you allowed updates on Mondays, use to define the time on a Monday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Monday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "tuesday": {
              "default": "false",
              "format": "checkbox",
              "title": "Tuesday",
              "description": "If selected, update prompts will be allowed on Tuesdays",
              "type": "boolean"
            },
            "tuesdayStartTime": {
              "description": "If you allowed updates on Tuesdays, use to define the time on a Tuesday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Tuesday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "tuesdayEndTime": {
              "description": "If you allowed updates on Tuesdays, use to define the time on a Tuesday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Tuesday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "wednesday": {
              "default": "false",
              "format": "checkbox",
              "title": "Wednesday",
              "description": "If selected, update prompts will be allowed on Wednesdays",
              "type": "boolean"
            },
            "wednesdayStartTime": {
              "description": "If you allowed updates on Wednesdays, use to define the time on a Wednesday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Wednesday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "wednesdayEndTime": {
              "description": "If you allowed updates on Wednesdays, use to define the time on a Wednesday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Wednesday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "thursday": {
              "default": "false",
              "format": "checkbox",
              "title": "Thursday",
              "description": "If selected, update prompts will be allowed on Thursdays",
              "type": "boolean"
            },
            "thursdayStartTime": {
              "description": "If you allowed updates on Thursdays, use to define the time on a Thursday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Thursday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "thursdayEndTime": {
              "description": "If you allowed updates on Thursdays, use to define the time on a Thursday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Thursday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "friday": {
              "default": "false",
              "format": "checkbox",
              "title": "Friday",
              "description": "If selected, update prompts will be allowed on Fridays",
              "type": "boolean"
            },
            "fridayStartTime": {
              "description": "If you allowed updates on Fridays, use to define the time on a Friday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Friday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "fridayEndTime": {
              "description": "If you allowed updates on Fridays, use to define the time on a Friday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Friday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "saturday": {
              "default": "false",
              "format": "checkbox",
              "title": "Saturday",
              "description": "If selected, update prompts will be allowed on Saturdays",
              "type": "boolean"
            },
            "saturdayStartTime": {
              "description": "If you allowed updates on Saturdays, use to define the time on a Saturday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Saturday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "saturdayEndTime": {
              "description": "If you allowed updates on Saturdays, use to define the time on a Saturday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Saturday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "sunday": {
              "default": "false",
              "format": "checkbox",
              "title": "Sunday",
              "description": "If selected, update prompts will be allowed on Sundays",
              "type": "boolean"
            },
            "sundayStartTime": {
              "description": "If you allowed updates on Sundays, use to define the time on a Sunday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Sunday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "sundayEndTime": {
              "description": "If you allowed updates on Sundays, use to define the time on a Sunday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Sunday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            }
          },
          "title": "Run Limitation Options",
          "description": "Use this preference to limit which weekdays and times DARE Update is allowed to prompt users to install pending updates. Check the boxes next to any days you wish to allow DARE Update to prompt users, and uncheck any days you want update prompts to be skipped. If you allow DARE Update to run on a particular day, you can then limit runs to a specific time window using the start and end time fields. Note: If you have specified a weekly patch day and that day is not checked below, the patch day setting will override this setting",
          "type": "object"
        },
        "deferralConfiguration": {
          "format": "grid",
          "properties": {
            "deferralOption": {
              "default": "specifyDeferralLimit",
              "enum": [
                "disableDeferralLimit",
                "specifyDeferralLimit",
                "disableDeferrals"
              ],
              "options": {
                "enum_titles": [
                  "Disable Deferral Limit",
                  "Specify Deferral Limit",
                  "Disable Deferrals"
                ]
              },
              "title": "Select a Deferral Option",
              "description": "Use to define behaviour around update deferrals. To allow the user to continue deferring with no limit and force the update on-demand, select Disable Deferral Limit. To set a limit on the amount of allowed deferrals, select Specify Deferral Limit. Alternatively, you can disable deferrals completely by selecting Disable Deferrals, which will only allow a grace period for updates",
              "type": "string"
            },
            "specifyLimit": {
              "options": {
                "dependencies": {
                  "deferralOption": "specifyDeferralLimit"
                }
              },
              "title": "Deferral Limit",
              "description": "Specify a custom deferral limit. The default deferral limit if not specified is 2",
              "type": "integer",
              "minimum": 1,
              "default": 2
            }
          },
          "required": [
            "deferralOption"
          ],
          "title": "Deferral Options",
          "type": "object"
        },
        "gracePeriodMinutes": {
          "title": "Grace Period in Minutes",
          "description": "The amount of time a user is given to save work before updates are installed automatically when there are no remaining deferrals. Default is 15 minutes",
          "options": {
            "inputAttributes": {
              "placeholder": "15"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "integer",
              "minimum": 1,
              "default": 15
            }
          ]
        },
        "customIcon": {
          "title": "Custom Icon",
          "description": "A custom icon to be displayed on the user prompts. The default is the Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialPromptOverlayIcon": {
          "title": "Initial Prompt Icon Overlay",
          "description": "An icon overlay on the initial update prompts. The overlay is displayed on the bottom right of the main icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customInitialPromptSize": {
          "title": "Custom Initial Prompt Size",
          "description": "Use to customise the size of the initial prompt displayed to users when they can either defer or update. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customGracePromptSize": {
          "title": "Custom Grace Period Prompt Size",
          "description": "Use to customise the size of the grace period timer prompt shown when users have no remaining deferrals. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customSelfServicePromptSize": {
          "title": "Custom Self Service Prompt Size",
          "description": "Use to customise the size of the prompt displayed to users when they initiate a Self Service update. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "singleAppTitle": {
          "title": "Custom Single App Title",
          "description": "A custom title to be displayed on the user prompts when there is 1 pending App update",
          "options": {
            "inputAttributes": {
              "placeholder": "appName Update Available"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleAppsTitle": {
          "title": "Custom Multiple Apps Title",
          "description": "A custom title to be displayed on the user prompts when there is more than 1 pending App update",
          "options": {
            "inputAttributes": {
              "placeholder": "Important Updates Available"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleInitialQuitPromptMessage": {
          "title": "Single App Initial Quit Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there is 1 pending App update and the App can quit to update. This prompt offers the option to defer update",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, An important update is pending which requires the App to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleInitialQuitPromptMessage": {
          "title": "Multiple Apps Initial Quit Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there is multiple pending App updates and the Apps can quit to update. This prompt offers the option to defer update",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require Apps to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleSelfServiceQuitMessage": {
          "title": "Single App Self Service Quit Prompt Message",
          "description": "A custom message displayed on the prompt shown when a user initiates Self Service updates and there is 1 pending App update that requires the App to quit",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, An important update is pending which requires the App to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleSelfServiceQuitMessage": {
          "title": "Multiple App Self Service Quit Prompt Message",
          "description": "A custom message displayed on the prompt shown when a user initiates Self Service updates and there are multiple pending App updates that require the Apps to quit",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require Apps to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleAppGracePeriodQuitMessage": {
          "title": "Single App Grace Period Quit Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there is 1 pending update and the App can quit to update. This prompt displays when there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleAppGracePeriodQuitMessage": {
          "title": "Multiple Apps Grace Period Quit Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there are multiple pending updates and the Apps can quit to update. This prompt displays when there are no deferrals configured or remaining. The Apps which require an update will be listed below this message",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleInitialLogOutPromptMessage": {
          "title": "Single App Initial Log Out Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there is 1 pending App update and the App requires a Log Out to update. This prompt offers the option to Defer or Log out",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, An important update is pending which requires a Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleInitialLogOutPromptMessage": {
          "title": "Multiple Apps Initial Log Out Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there are multiple pending App updates and one or more Apps require a Log Out to update. This prompt offers the option to Defer or Log Out",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, A Log Out is required for one or more of the Apps listed..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleSelfServiceLogOutMessage": {
          "title": "Single App Self Service Log Out Prompt Message",
          "description": "A custom message displayed on the prompt shown when a user initiates Self Service updates and there is 1 pending App update that requires a Log Out to update",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, An important update is pending which requires the App to Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleSelfServiceLogOutMessage": {
          "title": "Multiple App Self Service Log Out Prompt Message",
          "description": "A custom message displayed on the prompt shown when a user initiates Self Service updates and there are one or more Apps that require a Log Out to update",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require a Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleAppGracePeriodLogOutMessage": {
          "title": "Single App Grace Period Log Out Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there is one pending update and the App requires a Log Out update. This prompt displays when there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleAppGracePeriodLogOutMessage": {
          "title": "Multiple Apps Grace Period Log Out Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there are multiple pending updates and one or more Apps require a Log Out to update. This prompt displays when there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customDeferButton": {
          "title": "Custom Defer Button",
          "description": "A custom Defer button label displayed on prompts where deferrals are allowed",
          "options": {
            "inputAttributes": {
              "placeholder": "Defer"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customSkipButton": {
          "title": "Custom Self Service Skip Button",
          "description": "A custom Skip button label displayed on the Self Service update prompts that allows users to back out of installing updates without affecting deferrals",
          "options": {
            "inputAttributes": {
              "placeholder": "Skip"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customUpdateButton": {
          "title": "Custom Update Button",
          "description": "A custom Update button label displayed on prompts where Apps can quit to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Update"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customLogOutButton": {
          "title": "Custom Log Out Button",
          "description": "A custom Log Out button label displayed on prompts where Apps require a Log Out to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Log Out"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "appListType": {
          "title": "App List Type",
          "description": "Determines how to display the list of Apps on the update prompts. Apps can either be displayed in a vertical scrollable list beneath the prompt message, or displayed horizontally as part of the prompt message. When using the horizontal list option, the list of Apps is stored in the appList variable",
          "options": {
            "enum_titles": [
              "Vertical List",
              "Horizontal List"
            ]
          },
          "default": "",
          "enum": [
            "vertical",
            "horizontal"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "refreshInterval": {
          "title": "Prompt Refresh Interval",
          "description": "The amount of time in seconds the user prompts refresh. The prompts require a refresh to pull focus if the user swipes away to ignore the prompt and ensures they either select defer or update. The default value is 20 seconds. The minimum allowed value is 10 seconds",
          "options": {
            "inputAttributes": {
              "placeholder": "20"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "integer",
              "minimum": 10,
              "default": 20
            }
          ]
        },
        "acceptableAppBundleIDs": {
          "title": "Do Not Disturb Applications",
          "description": "Application Bundle IDs specified here will prevent DARE Update from prompting users to update if the App(s) are identified as being active in the foreground (You can specify one or more Bundle IDs). To get Bundle IDs, enter the following in terminal (replacing Safari with the relevant App): defaults read /Applications/Safari.app/Contents/Info.plist CFBundleIdentifier",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Do Not Disturb Application Bundle ID"
              }
            }
          ]
        },
        "acceptableCameraUsage": {
          "title": "Do Not Disturb Camera Usage",
          "description": "Setting as True will prevent DARE Update from prompting users if the camera is in use. Note: Apple Silicon Macs running macOS 12 (Monterey) do not accurately report camera usage, therefore this setting will be ignored. Upgrading to macOS 13 (Ventura) will resolve this issue for Apple Silicon Macs.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "acceptableScreenSharing": {
          "title": "Do Not Disturb Screen Sharing",
          "description": "Setting as True will prevent DARE Update from prompting users if Screen Sharing is in use.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "performLogoutUpdates": {
          "title": "Perform Logout Updates",
          "description": "By default, DARE Update will perform all updates regardless of whether the update requires a Log Out. To have DARE Update only prompt users when no Log Out is required, set this option as false (not recommended)",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "updateProgressPosition": {
          "title": "Quit Update Progress Position",
          "description": "The position on the screen of the prompt which displays the progress of an App-quit update. The default position is top right.",
          "options": {
            "enum_titles": [
              "Top right",
              "Right",
              "Bottom right",
              "Top left",
              "Left",
              "Bottom left",
              "Top centre",
              "Centre",
              "Bottom centre"
            ]
          },
          "default": "",
          "enum": [
            "topright",
            "right",
            "bottomright",
            "topleft",
            "left",
            "bottomleft",
            "top",
            "center/centre",
            "bottom"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "updateProgressPrompt": {
          "title": "Update Progress Prompt Behaviour",
          "description": "Determines the behaviour of the prompt shown when updates are in progress. You can either select a prompt that does not take focus over other running Apps (default), a prompt that does take focus over all other running Apps, or disable the progress prompt completely. If you chose to show no prompt, you can still configure an updates complete prompt to inform users the update has finished",
          "options": {
            "enum_titles": [
              "Prompt without focus",
              "Prompt with focus",
              "Don't show a prompt"
            ]
          },
          "default": "",
          "enum": [
            "noFocusPrompt",
            "focusPrompt",
            "noPrompt"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "updateProgressOverlayIcon": {
          "title": "Update Progress Prompt Overlay Icon",
          "description": "An icon overlay on the prompt shown during the App updates. The overlay is displayed on the bottom right of the main icon, which on this prompt is the App icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "displayCompletePrompt": {
          "title": "Display Complete Message",
          "description": "Determines whether a prompt is displayed to the user to inform them that the updates are complete. The prompt will inherit the same window position as the Update Progress prompt. Default is true",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        }
      }
    },
    "ForcedUpdates": {
      "type": "object",
      "title": "Forced Update Options",
      "properties": {
        "runLimitations": {
          "format": "grid",
          "properties": {
            "monday": {
              "default": "false",
              "format": "checkbox",
              "title": "Monday",
              "description": "If selected, forced update prompts will be allowed on Mondays",
              "type": "boolean"
            },
            "mondayStartTime": {
              "description": "If you allowed forced updates on Mondays, use to define the time on a Monday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Monday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "mondayEndTime": {
              "description": "If you allowed forced updates on Mondays, use to define the time on a Monday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Monday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "tuesday": {
              "default": "false",
              "format": "checkbox",
              "title": "Tuesday",
              "description": "If selected, forced update prompts will be allowed on Tuesdays",
              "type": "boolean"
            },
            "tuesdayStartTime": {
              "description": "If you allowed forced updates on Tuesdays, use to define the time on a Tuesday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Tuesday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "tuesdayEndTime": {
              "description": "If you allowed forced updates on Tuesdays, use to define the time on a Tuesday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Tuesday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "wednesday": {
              "default": "false",
              "format": "checkbox",
              "title": "Wednesday",
              "description": "If selected, forced update prompts will be allowed on Wednesdays",
              "type": "boolean"
            },
            "wednesdayStartTime": {
              "description": "If you allowed forced updates on Wednesdays, use to define the time on a Wednesday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Wednesday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "wednesdayEndTime": {
              "description": "If you allowed forced updates on Wednesdays, use to define the time on a Wednesday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Wednesday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "thursday": {
              "default": "false",
              "format": "checkbox",
              "title": "Thursday",
              "description": "If selected, forced update prompts will be allowed on Thursdays",
              "type": "boolean"
            },
            "thursdayStartTime": {
              "description": "If you allowed forced updates on Thursdays, use to define the time on a Thursday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Thursday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "thursdayEndTime": {
              "description": "If you allowed forced updates on Thursdays, use to define the time on a Thursday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Thursday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "friday": {
              "default": "false",
              "format": "checkbox",
              "title": "Friday",
              "description": "If selected, forced update prompts will be allowed on Fridays",
              "type": "boolean"
            },
            "fridayStartTime": {
              "description": "If you allowed forced updates on Fridays, use to define the time on a Friday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Friday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "fridayEndTime": {
              "description": "If you allowed forced updates on Fridays, use to define the time on a Friday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Friday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "saturday": {
              "default": "false",
              "format": "checkbox",
              "title": "Saturday",
              "description": "If selected, forced update prompts will be allowed on Saturdays",
              "type": "boolean"
            },
            "saturdayStartTime": {
              "description": "If you allowed forced updates on Saturdays, use to define the time on a Saturday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Saturday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "saturdayEndTime": {
              "description": "If you allowed forced updates on Saturdays, use to define the time on a Saturday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Saturday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "sunday": {
              "default": "false",
              "format": "checkbox",
              "title": "Sunday",
              "description": "If selected, forced update prompts will be allowed on Sundays",
              "type": "boolean"
            },
            "sundayStartTime": {
              "description": "If you allowed forced updates on Sundays, use to define the time on a Sunday DARE Update is permitted to start prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Sunday Start Time",
              "minimum": 1,
              "default": "00:00",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            },
            "sundayEndTime": {
              "description": "If you allowed forced updates on Sundays, use to define the time on a Sunday DARE Update should stop prompting users to install pending updates. This should be in 24 hour format, e.g., 09:00 for 9am, or 21:00 for 9pm",
              "title": "Sunday End Time",
              "minimum": 1,
              "default": "23:59",
              "type": "string",
              "pattern": "^([01]\\d|2[0-3]):?([0-5]\\d)$"
            }
          },
          "title": "Run Limitation Options",
          "description": "Use this preference to limit which weekdays and times DARE Update is allowed to prompt users to install forced updates. Check the boxes next to any days you wish to allow DARE Update to prompt users, and uncheck any days you want update prompts to be skipped. If you allow DARE Update to run on a particular day, you can then limit runs to a specific time window using the start and end time fields. Note: If you have specified a weekly patch day and that day is not checked below, the patch day setting will override this setting",
          "type": "object"
        },
        "customIcon": {
          "title": "Custom Icon",
          "description": "A custom icon to be displayed on the user prompts. The default when not specified is the icon of the App being forced to update",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialPromptOverlayIcon": {
          "title": "Initial Prompt Overlay Icon",
          "description": "An icon overlay on the initial or grace period update prompts. The overlay is displayed on the bottom right of the main icon, which on this prompt is the App icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customInitialPromptSize": {
          "title": "Custom Initial Prompt Size",
          "description": "Use to customise the size of the initial prompt displayed to users when they can either defer or update. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customGracePromptSize": {
          "title": "Custom Grace Period Prompt Size",
          "description": "Use to customise the size of the grace period timer prompt shown when users have no remaining deferrals. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customTitle": {
          "title": "Custom Title",
          "description": "A custom title to be displayed on the initial force update prompts which are shown prior to the updates running, e.g the defer/update prompt (if configured) or the grace period prompt",
          "options": {
            "inputAttributes": {
              "placeholder": "appName Update Required"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialQuitPromptMessage": {
          "title": "Initial Quit Prompt Message",
          "description": "A custom message displayed on the initial force update prompt shown when Apps can quit to update. This prompt offers the option to defer updates",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require Apps to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialLogOutPromptMessage": {
          "title": "Initial Log Out Prompt Message",
          "description": "A custom message displayed on the initial force update prompt shown when Apps require a Log Out to update. This prompt offers the option to defer updates",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require a Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "gracePeriodQuitPromptMessage": {
          "title": "Grace Period Quit Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when Apps can quit to update and there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "gracePeriodLogOutPromptMessage": {
          "title": "Grace Period Log Out Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when Apps require a Log Out to update and there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customDeferButton": {
          "title": "Custom Defer Button",
          "description": "A custom Defer button displayed on prompts where deferrals are allowed",
          "options": {
            "inputAttributes": {
              "placeholder": "Defer"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customUpdateButton": {
          "title": "Custom Update Button",
          "description": "A custom Update button label displayed on prompts where Apps can quit to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Update"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customLogOutButton": {
          "title": "Custom Log Out Button",
          "description": "A custom Log Out button label displayed on prompts where Apps require a Log Out to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Log Out"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "refreshInterval": {
          "title": "Prompt Refresh Interval",
          "description": "The amount of time in seconds the user prompts refresh when deferrals have been configured for forced updates. The prompts require a refresh to pull focus if the user swipes away to ignore the prompt and ensures they either select defer or update. The default value is 20 seconds. The minimum allowed value is 10 seconds",
          "options": {
            "inputAttributes": {
              "placeholder": "20"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "integer",
              "minimum": 10,
              "default": 20
            }
          ]
        },
        "acceptableAppBundleIDs": {
          "title": "Do Not Disturb Applications",
          "description": "Application Bundle IDs specified here will prevent DARE Update from prompting users to update if the App(s) are identified as being active in the foreground (You can specify one or more Bundle IDs). To get Bundle IDs, enter the following in terminal (replacing Safari with the relevant App): defaults read /Applications/Safari.app/Contents/Info.plist CFBundleIdentifier",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Do Not Disturb Application Bundle ID"
              }
            }
          ]
        },
        "acceptableCameraUsage": {
          "title": "Do Not Disturb Camera Usage",
          "description": "Setting as True will prevent DARE Update from prompting users if the camera is in use. Note: Apple Silicon Macs running macOS 12 (Monterey) do not accurately report camera usage, therefore this setting will be ignored. Upgrading to macOS 13 (Ventura) will resolve this issue for Apple Silicon Macs.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "acceptableScreenSharing": {
          "title": "Do Not Disturb Screen Sharing",
          "description": "Setting as True will prevent DARE Update from prompting users if Screen Sharing is in use.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "performLogoutUpdates": {
          "title": "Perform Logout Updates",
          "description": "By default, DARE Update will perform all updates regardless of whether the update requires a Log Out. To have DARE Update only prompt users when no Log Out is required, set this option as false (not recommended)",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "updateProgressPosition": {
          "title": "Quit Update Progress Position",
          "description": "The position on the screen of the prompt which displays the progress of an App-quit update. The default position is top right.",
          "options": {
            "enum_titles": [
              "Top right",
              "Right",
              "Bottom right",
              "Top left",
              "Left",
              "Bottom left",
              "Top centre",
              "Centre",
              "Bottom centre"
            ]
          },
          "default": "",
          "enum": [
            "topright",
            "right",
            "bottomright",
            "topleft",
            "left",
            "bottomleft",
            "top",
            "center/centre",
            "bottom"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "updateProgressPrompt": {
          "title": "Update Progress Prompt Behaviour",
          "description": "Determines the behaviour of the prompt shown when updates are in progress. You can either select a prompt that does not take focus over other running Apps (default), a prompt that does take focus over all other running Apps, or disable the progress prompt completely. If you chose to show no prompt, you can still configure an updates complete prompt to inform users the update has finished",
          "options": {
            "enum_titles": [
              "Prompt without focus",
              "Prompt with focus",
              "Don't show a prompt"
            ]
          },
          "default": "",
          "enum": [
            "noFocusPrompt",
            "focusPrompt",
            "noPrompt"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "updateProgressOverlayIcon": {
          "title": "Update Progress Prompt Overlay Icon",
          "description": "An icon overlay on the prompt shown during App updates. The overlay is displayed on the bottom right of the main icon, which on this prompt is the App icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "displayCompletePrompt": {
          "title": "Display Complete Message",
          "description": "Determines whether a prompt is displayed to the user to inform them that the updates are complete. The prompt will inherit the same window position as the Update Progress prompt. Default is true",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        }
      }
    }
  }
}