{
  "title": "DARE Update Custom Preferences",
  "description": "Use to customise DARE Update user prompt preferences.",
  "__preferencedomain": "com.dare.update.preferences",
  "properties": {
    "ScheduledUpdates": {
      "type": "object",
      "title": "Scheduled Updates",
      "properties": {
        "deferralConfiguration": {
          "format": "grid",
          "properties": {
            "deferralOption": {
              "default": "specifyDeferralLimit",
              "enum": [
                "disableDeferralLimit",
                "specifyDeferralLimit",
                "disableDeferrals"
              ],
              "options": {
                "enum_titles": [
                  "Disable Deferral Limit",
                  "Specify Deferral Limit",
                  "Disable Deferrals"
                ]
              },
              "title": "Select a Deferral Option",
              "description": "Use to define behaviour around update deferrals. To allow the user to continue deferring with no limit and force the update on-demand, select Disable Deferral Limit. To set a limit on the amount of allowed deferrals, select Specify Deferral Limit. Alternatively, you can disable deferrals completely by selecting Disable Deferrals, which will only allow a grace period for updates",
              "type": "string"
            },
            "specifyLimit": {
              "options": {
                "dependencies": {
                  "deferralOption": "specifyDeferralLimit"
                }
              },
              "title": "Deferral Limit",
              "description": "Specify a custom deferral limit. The default deferral limit if not specified is 2",
              "type": "integer",
              "minimum": 1,
              "default": 2
            }
          },
          "required": [
            "deferralOption"
          ],
          "title": "Deferral Options",
          "type": "object"
        },
        "runLimitations": {
          "format": "grid",
          "properties": {
            "runType": {
              "default": "specifyPatchDay",
              "enum": [
                "specifyPatchDay",
                "specifyFrequency"
              ],
              "options": {
                "enum_titles": [
                  "Specify Patch Day",
                  "Specify Patch Frequency"
                ]},
              "title": "Run Limitation Option",
              "description": "This defines when to prompt users to install any pending updates. You can either limit user prompts to a specified weekly patch day, or alternatively select a frequency to prompt the users, e.g., once every 2 weeks",
              "type": "string",
              "propertyOrder": 1
              
            },
            "frequencyOption": {
              "default": "oneWeek",
              "enum": [
                "oneDay",
                "oneWeek",
                "twoWeeks",
                "threeWeeks",
                "fourWeeks"
              ],
              "options": {
                "dependencies": {
                  "runType": "specifyFrequency"
                },
                "enum_titles": [
                  "Once every day",
                  "Once every week",
                  "Once every two weeks",
                  "Once every three weeks",
                  "Once every four weeks"
                ]},
              "title": "Frequency to prompt users",
              "type": "string",
              "minLength": 1
            },
            "singlePromptMode": {
              "default": "true",
              "format": "checkbox",
              "options": {
                "dependencies": {
                  "runType": "specifyFrequency"
                }
              },
              "title": "Single Prompt Mode",
              "description": "When enabled, DARE Update will only prompt the user once after the specified frequency time period has elapsed even if the user defers the update. When disabled, if the specified frequency time period has elapsed, the user will be prompted to update every time the launch daemon runs DARE Update until the user installs the pending updates",
              "type": "boolean"
            },
            "patchDay": {
              "default": 5,
              "title": "Patch Day",
              "type": "integer",
              "minLength": 1,
              "propertyOrder": 20,
              "description": "The day of the week to prompt users to install cached updates",
              "enum": [
                2,
                3,
                4,
                5,
                6,
                7,
                1
              ],
              "options": {
                "enum_titles": [
                  "Monday",
                  "Tuesday",
                  "Wednesday",
                  "Thursday",
                  "Friday",
                  "Saturday",
                  "Sunday"
                ],
                "dependencies": {
                  "runType": "specifyPatchDay"
                }
              }
            },
            "missedUpdatePrompt": {
              "default": true,
              "description": "When enabled, DARE Update will prompt the user to update whenever the device comes back online if it was offline on the defined patch day. A launch daemon to run DARE Update on a daily recurring basis must be configured for this to work. Alternatively, leave this unchecked to wait until the next patch day to prompt the user if their device was offline on the previous patch day",
              "format": "checkbox",
              "title": "Missed Update Prompts",
              "type": "boolean",
              "options": {
                "dependencies": {
                  "runType": "specifyPatchDay"
                }
              }
            },
            "singlePatchDayPrompt": {
              "default": true,
              "description": "When enabled, DARE Update will ensure the user is only prompted once on the configured patch day if there are pending updates. This allows you to configure the launch daemon to run DARE Update on a recurring basis during patch day, meaning that if an acceptable use scenario causes the prompt to skip, DARE Update can continue attempting to prompt the user on the next run. After successfully prompting the user, DARE Update will ensure no further prompts are displayed until the next patch day if the update was deferred. Alternatively, leave unchecked if you plan to prompt the user on a recurring basis on the configured patch day",
              "format": "checkbox",
              "title": "Single Patch Day Prompt",
              "type": "boolean",
              "options": {
                "dependencies": {
                  "runType": "specifyPatchDay"
                }
              }
            }
          },
          "required": [
            "runType"
          ],
          "title": "Run Limitations",
          "type": "object"
        },
        "gracePeriodMinutes": {
          "title": "Grace Period in Minutes",
          "description": "The amount of time a user is given to save work before updates are installed automatically when there are no remaining deferrals. Default is 15 minutes",
          "options": {
            "inputAttributes": {
              "placeholder": "15"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "integer",
              "minimum": 1,
              "default": 15
            }
          ]
        },
        "customIcon": {
          "title": "Custom Icon",
          "description": "A custom icon to be displayed on the user prompts. The default is the Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialPromptOverlayIcon": {
          "title": "Initial Prompt Icon Overlay",
          "description": "An icon overlay on the initial update prompts. The overlay is displayed on the bottom right of the main icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customInitialPromptSize": {
          "title": "Custom Initial Prompt Size",
          "description": "Use to customise the size of the initial prompt displayed to users when they can either defer or update. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customGracePromptSize": {
          "title": "Custom Grace Period Prompt Size",
          "description": "Use to customise the size of the grace period timer prompt shown when users have no remaining deferrals. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "singleAppTitle": {
          "title": "Custom Single App Title",
          "description": "A custom title to be displayed on the user prompts when there is 1 pending App update",
          "options": {
            "inputAttributes": {
              "placeholder": "appName Update Available"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleAppsTitle": {
          "title": "Custom Multiple Apps Title",
          "description": "A custom title to be displayed on the user prompts when there is more than 1 pending App update",
          "options": {
            "inputAttributes": {
              "placeholder": "Important Updates Available"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleInitialQuitPromptMessage": {
          "title": "Single App Initial Quit Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there is 1 pending App update and the App can quit to update. This prompt offers the option to defer update",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, An important update is pending which requires the App to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleInitialQuitPromptMessage": {
          "title": "Multiple Apps Initial Quit Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there is multiple pending App updates and the Apps can quit to update. This prompt offers the option to defer update",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require Apps to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleAppGracePeriodQuitMessage": {
          "title": "Single App Grace Period Quit Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there is 1 pending update and the App can quit to update. This prompt displays when there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleAppGracePeriodQuitMessage": {
          "title": "Multiple Apps Grace Period Quit Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there are multiple pending updates and the Apps can quit to update. This prompt displays when there are no deferrals configured or remaining. The Apps which require an update will be listed below this message",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleInitialLogOutPromptMessage": {
          "title": "Single App Initial Log Out Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there is 1 pending App update and the App requires a Log Out to update. This prompt offers the option to Defer or Log out",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, An important update is pending which requires a Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleInitialLogOutPromptMessage": {
          "title": "Multiple Apps Initial Log Out Prompt Message",
          "description": "A custom message displayed on the initial prompt shown when there are multiple pending App updates and one or more Apps require a Log Out to update. This prompt offers the option to Defer or Log Out",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, A Log Out is required for one or more of the Apps listed..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "singleAppGracePeriodLogOutMessage": {
          "title": "Single App Grace Period Log Out Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there is one pending update and the App requires a Log Out update. This prompt displays when there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "multipleAppGracePeriodLogOutMessage": {
          "title": "Multiple Apps Grace Period Log Out Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when there are multiple pending updates and one or more Apps require a Log Out to update. This prompt displays when there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customDeferButton": {
          "title": "Custom Defer Button",
          "description": "A custom Defer button displayed on prompts where deferrals are allowed",
          "options": {
            "inputAttributes": {
              "placeholder": "Defer"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customUpdateButton": {
          "title": "Custom Update Button",
          "description": "A custom Update button label displayed on prompts where Apps can quit to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Update"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customLogOutButton": {
          "title": "Custom Log Out Button",
          "description": "A custom Log Out button label displayed on prompts where Apps require a Log Out to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Log Out"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "appListType": {
          "title": "App List Type",
          "description": "Determines how to display the list of Apps on the update prompts. Apps can either be displayed in a vertical scrollable list beneath the prompt message, or displayed horizontally as part of the prompt message. When using the horizontal list option, the list of Apps is stored in the appList variable",
          "options": {
            "enum_titles": [
              "Vertical List",
              "Horizontal List"
            ]
          },
          "default": "",
          "enum": [
            "vertical",
            "horizontal"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "refreshInterval": {
          "title": "Prompt Refresh Interval",
          "description": "The amount of time in seconds the user prompts refresh. The prompts require a refresh to pull focus if the user swipes away to ignore the prompt and ensures they either select defer or update. The default value is 20 seconds. The minimum allowed value is 10 seconds",
          "options": {
            "inputAttributes": {
              "placeholder": "20"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "integer",
              "minimum": 10,
              "default": 20
            }
          ]
        },
        "acceptableAppBundleIDs": {
          "title": "Acceptable App Bundle IDs",
          "description": "Application Bundle IDs specified here will prevent DARE Update from prompting users to update if the App(s) are identified as being active in the foreground (You can specify one or more Bundle IDs). To get Bundle IDs, enter the following in terminal (replacing Safari with the relevant App): defaults read /Applications/Safari.app/Contents/Info.plist CFBundleIdentifier",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Acceptable App Bundle ID"
              }
            }
          ]
        },
        "acceptableCameraUsage": {
          "title": "Acceptable Camera Usage",
          "description": "Setting as True will prevent DARE Update from prompting users if the camera is in use. Note: Apple Silicon Macs running macOS 12 (Monterey) do not accurately report camera usage, therefore this setting will be ignored. Upgrading to macOS 13 (Ventura) will resolve this issue for Apple Silicon Macs.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "acceptableScreenSharing": {
          "title": "Acceptable Screen Sharing Usage",
          "description": "Setting as True will prevent DARE Update from prompting users if Screen Sharing is in use.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "performLogoutUpdates": {
          "title": "Perform Logout Updates",
          "description": "By default, DARE Update will perform all updates regardless of whether the update requires a Log Out. To have DARE Update only prompt users when no Log Out is required, set this option as false (not recommended)",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "updateProgressPosition": {
          "title": "Quit Update Progress Position",
          "description": "The position on the screen of the prompt which displays the progress of an App-quit update. The default position is top right.",
          "options": {
            "enum_titles": [
              "Top right",
              "Right",
              "Bottom right",
              "Top left",
              "Left",
              "Bottom left",
              "Top centre",
              "Centre",
              "Bottom centre"
            ]
          },
          "default": "",
          "enum": [
            "topright",
            "right",
            "bottomright",
            "topleft",
            "left",
            "bottomleft",
            "top",
            "center/centre",
            "bottom"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "updateProgressFocus": {
          "title": "Quit Update Progress Prompt Focus",
          "description": "Determines whether the quit update progress prompt is always on top during quit updates. True makes the prompt appear on top of any other Apps, False will allow other apps to be on top of the progress prompt",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "updateProgressOverlayIcon": {
          "title": "Update Progress Prompt Overlay Icon",
          "description": "An icon overlay on prompt shown during the App updates. The overlay is displayed on the bottom right of the main icon, which on this prompt is the App icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "displayCompletePrompt": {
          "title": "Display Complete Message",
          "description": "Determines whether a prompt is displayed to the user to inform them that the updates are complete. The prompt will inherit the same window position as the Update Progress prompt. Default is true",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        }
      }
    },
    "ForcedUpdates": {
      "type": "object",
      "title": "Forced Updates",
      "properties": {
        "customIcon": {
          "title": "Custom Icon",
          "description": "A custom icon to be displayed on the user prompts. The default when not specified is the icon of the App being forced to update",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialPromptOverlayIcon": {
          "title": "Initial Prompt Overlay Icon",
          "description": "An icon overlay on the initial or grace period update prompts. The overlay is displayed on the bottom right of the main icon, which on this prompt is the App icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customInitialPromptSize": {
          "title": "Custom Initial Prompt Size",
          "description": "Use to customise the size of the initial prompt displayed to users when they can either defer or update. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customGracePromptSize": {
          "title": "Custom Grace Period Prompt Size",
          "description": "Use to customise the size of the grace period timer prompt shown when users have no remaining deferrals. Note: Only configure this setting if defining custom prompt messages. If you are using the default prompt messages, customising prompt size is not recommended as the default prompt size is pre-configured to correctly match the size of the default message displayed",
          "properties": {
            "promptHeight": {
              "description": "Use to define a custom height in points for the prompts shown to users, e.g., 330",
              "title": "Custom prompt height",
              "minimum": 1,
              "default": 330,
              "type": "integer"
            },
            "promptWidth": {
              "description": "Use to define a custom width in points for the prompts shown to users, e.g., 640",
              "title": "Custom prompt width",
              "minimum": 1,
              "default": 640,
              "type": "integer"
            }
          },
          "required": [
            "promptHeight",
            "promptWidth"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured"
            }
          ]
        },
        "customTitle": {
          "title": "Custom Title",
          "description": "A custom title to be displayed on the initial force update prompts which are shown prior to the updates running, e.g the defer/update prompt (if configured) or the grace period prompt",
          "options": {
            "inputAttributes": {
              "placeholder": "appName Update Required"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialQuitPromptMessage": {
          "title": "Initial Quit Prompt Message",
          "description": "A custom message displayed on the initial force update prompt shown when Apps can quit to update. This prompt offers the option to defer updates",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require Apps to quit..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "initialLogOutPromptMessage": {
          "title": "Initial Log Out Prompt Message",
          "description": "A custom message displayed on the initial force update prompt shown when Apps require a Log Out to update. This prompt offers the option to defer updates",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Important updates are pending which require a Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "gracePeriodQuitPromptMessage": {
          "title": "Grace Period Quit Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when Apps can quit to update and there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click update..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "gracePeriodLogOutPromptMessage": {
          "title": "Grace Period Log Out Prompt Message",
          "description": "A custom message displayed on the grace period prompt shown when Apps require a Log Out to update and there are no deferrals configured or remaining",
          "options": {
            "inputAttributes": {
              "placeholder": "E.g, Please save your work and click Log Out..."
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customDeferButton": {
          "title": "Custom Defer Button",
          "description": "A custom Defer button displayed on prompts where deferrals are allowed",
          "options": {
            "inputAttributes": {
              "placeholder": "Defer"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customUpdateButton": {
          "title": "Custom Update Button",
          "description": "A custom Update button label displayed on prompts where Apps can quit to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Update"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "customLogOutButton": {
          "title": "Custom Log Out Button",
          "description": "A custom Log Out button label displayed on prompts where Apps require a Log Out to update",
          "options": {
            "inputAttributes": {
              "placeholder": "Log Out"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "refreshInterval": {
          "title": "Prompt Refresh Interval",
          "description": "The amount of time in seconds the user prompts refresh when deferrals have been configured for forced updates. The prompts require a refresh to pull focus if the user swipes away to ignore the prompt and ensures they either select defer or update. The default value is 20 seconds. The minimum allowed value is 10 seconds",
          "options": {
            "inputAttributes": {
              "placeholder": "20"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "integer",
              "minimum": 10,
              "default": 20
            }
          ]
        },
        "acceptableAppBundleIDs": {
          "title": "Acceptable App Bundle IDs",
          "description": "Application Bundle IDs specified here will prevent DARE Update from prompting users to update if the App(s) are identified as being active in the foreground (You can specify one or more Bundle IDs). To get Bundle IDs, enter the following in terminal (replacing Safari with the relevant App): defaults read /Applications/Safari.app/Contents/Info.plist CFBundleIdentifier",
          "anyOf": [
            {
              "title": "Not Configured",
              "type": "null"
            },
            {
              "title": "Configured",
              "type": "array",
              "items": {
                "options": {
                  "inputAttributes": {
                    "placeholder": "us.zoom.xos"
                  }
                },
                "type": "string",
                "title": "Acceptable App Bundle ID"
              }
            }
          ]
        },
        "acceptableCameraUsage": {
          "title": "Acceptable Camera Usage",
          "description": "Setting as True will prevent DARE Update from prompting users if the camera is in use. Note: Apple Silicon Macs running macOS 12 (Monterey) do not accurately report camera usage, therefore this setting will be ignored. Upgrading to macOS 13 (Ventura) will resolve this issue for Apple Silicon Macs.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "acceptableScreenSharing": {
          "title": "Acceptable Screen Sharing Usage",
          "description": "Setting as True will prevent DARE Update from prompting users if Screen Sharing is in use.",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "performLogoutUpdates": {
          "title": "Perform Logout Updates",
          "description": "By default, DARE Update will perform all updates regardless of whether the update requires a Log Out. To have DARE Update only prompt users when no Log Out is required, set this option as false (not recommended)",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "updateProgressPosition": {
          "title": "Quit Update Progress Position",
          "description": "The position on the screen of the prompt which displays the progress of an App-quit update. The default position is top right.",
          "options": {
            "enum_titles": [
              "Top right",
              "Right",
              "Bottom right",
              "Top left",
              "Left",
              "Bottom left",
              "Top centre",
              "Centre",
              "Bottom centre"
            ]
          },
          "default": "",
          "enum": [
            "topright",
            "right",
            "bottomright",
            "topleft",
            "left",
            "bottomleft",
            "top",
            "center/centre",
            "bottom"
          ],
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "updateProgressFocus": {
          "title": "Quit Update Progress Prompt Focus",
          "description": "Determines whether or not the quit update progress prompt is always on top during quit updates. True makes the prompt appear on top of any other Apps, False will allow other apps to be on top of the progress prompt",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        },
        "updateProgressOverlayIcon": {
          "title": "Update Progress Prompt Overlay Icon",
          "description": "An icon overlay on the prompt shown during App updates. The overlay is displayed on the bottom right of the main icon, which on this prompt is the App icon. Possible values are paths to a valid .png, .jpg or .icns file, or use the selfService variable for the Jamf Self Service icon",
          "options": {
            "inputAttributes": {
              "placeholder": "/usr/local/images/CustomIcon.png"
            }
          },
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "string"
            }
          ]
        },
        "displayCompletePrompt": {
          "title": "Display Complete Message",
          "description": "Determines whether a prompt is displayed to the user to inform them that the updates are complete. The prompt will inherit the same window position as the Update Progress prompt. Default is true",
          "anyOf": [
            {
              "type": "null",
              "title": "Not Configured"
            },
            {
              "title": "Configured",
              "type": "boolean"
            }
          ]
        }
      }
    }
  }
}